import KemonoGameBannerImg from '@/assets/banner/kemono_game.webp';

const KemonoGameIcon = ({ size = 32 }: { size?: number }) => {
  return (
    <svg
      viewBox="0 0 128 128"
      focusable="false"
      style={{ width: size, height: size }}
    >
      <path
        d="M47.7651 31.8326L47.7651 31.8326L47.9058 32.0989H48.2071H64.0003H79.7929H80.0942L80.2349 31.8326L80.2351 31.8323L80.2359 31.8308L80.2394 31.8242L80.2541 31.7967C80.2597 31.7864 80.2664 31.7738 80.2744 31.7591C80.2853 31.7389 80.2985 31.7148 80.3138 31.6867C80.3667 31.5899 80.4458 31.4471 80.549 31.2651C80.7555 30.9012 81.0587 30.3813 81.4439 29.7599C82.215 28.516 83.3112 26.8717 84.6146 25.2616C85.9208 23.6482 87.4195 22.0888 88.9923 20.9982C90.57 19.9042 92.1627 19.3222 93.6832 19.5485L93.7772 19.5625L93.8698 19.541C94.1302 19.4806 94.6468 19.52 95.4237 19.7683C96.1784 20.0095 97.1133 20.4263 98.1728 21.036C100.291 22.2545 102.874 24.2252 105.471 27.0373C110.662 32.6574 115.896 41.6292 117.568 54.648C119.247 67.7219 118.579 80.9388 116.191 90.9846C114.997 96.0098 113.378 100.213 111.43 103.205C109.476 106.205 107.245 107.909 104.84 108.119C99.5475 108.583 96.7784 108.543 94.6464 106.899C93.5727 106.071 92.6242 104.807 91.6157 102.888C90.6072 100.968 89.5587 98.4342 88.2658 95.0995C82.9782 81.461 69.6355 79.5488 64.0003 79.5488C58.3651 79.5488 45.0218 81.461 39.7342 95.0995C38.4413 98.4342 37.3928 100.968 36.3843 102.888C35.3758 104.807 34.4273 106.071 33.3536 106.899C31.2216 108.543 28.4525 108.583 23.1603 108.119C20.7553 107.909 18.5241 106.205 16.5702 103.205C14.6216 100.213 13.0035 96.0098 11.809 90.9846C9.42121 80.9388 8.75265 67.7219 10.4316 54.648C12.1035 41.6292 17.3383 32.6574 22.5286 27.0373C25.1257 24.2252 27.7095 22.2545 29.8272 21.036C30.8867 20.4263 31.8216 20.0095 32.5763 19.7683C33.3532 19.52 33.8698 19.4806 34.1302 19.541L34.2228 19.5625L34.3168 19.5485C35.8373 19.3222 37.43 19.9042 39.0077 20.9982C40.5805 22.0888 42.0792 23.6482 43.3854 25.2616C44.6888 26.8717 45.785 28.516 46.5561 29.7599C46.9413 30.3813 47.2445 30.9012 47.451 31.2651C47.5542 31.4471 47.6333 31.5899 47.6862 31.6867C47.7127 31.7352 47.7327 31.7721 47.7459 31.7967L47.7606 31.8242L47.7641 31.8308L47.7649 31.8323L47.7651 31.8326Z"
        fill="#1A202C"
        stroke="#EEEEEE"
      ></path>
      <path
        d="M34.354 23.6262C38.894 23.5112 42.625 32 42.625 32H24.625C24.625 32 29.814 23.7411 34.354 23.6262Z"
        fill="white"
      ></path>
      <path
        d="M93.646 23.6262C89.106 23.5112 85.375 32 85.375 32H103.375C103.375 32 98.186 23.7411 93.646 23.6262Z"
        fill="white"
      ></path>
      <path
        d="M39.8676 55.8824V51.4301C39.8676 49.6738 38.4438 48.25 36.6875 48.25C34.9312 48.25 33.5074 49.6738 33.5074 51.4301V55.8824H29.0551C27.2988 55.8824 25.875 57.3062 25.875 59.0625C25.875 60.8188 27.2988 62.2426 29.0551 62.2426H33.5074V66.7903C33.5074 68.4939 34.8884 69.875 36.5921 69.875C38.2958 69.875 39.6768 68.4939 39.6768 66.7903V62.2426H44.3199C46.0762 62.2426 47.5 60.8188 47.5 59.0625C47.5 57.3062 46.0762 55.8824 44.3199 55.8824H39.8676Z"
        fill="white"
      ></path>
      <circle cx="94.942" cy="51.8293" r="3.60788" fill="white"></circle>
      <circle cx="87.7262" cy="59.0451" r="3.60788" fill="white"></circle>
      <circle cx="94.942" cy="66.2608" r="3.60788" fill="white"></circle>
      <circle cx="102.158" cy="59.0451" r="3.60788" fill="white"></circle>
    </svg>
  );
};

const KemonoGameLink = 'https://kemono.games/zh-Hans?utm_source=linpx';

export const KemonoGameBannerIntro = () => {
  return (
    <>
      <img
        className="absolute object-cover w-full h-full opacity-20"
        src={KemonoGameBannerImg}
      />
      <div
        className="flex-col px-3 py-2 z-10"
        onClick={() => window.open(KemonoGameLink)}
      >
        <div className="flex justify-center items-center">
          <KemonoGameIcon size={60} />
          <div className="ml-2">
            <div className="font-bold text-xl leading-6">
              <a onClick={(e) => e.preventDefault()} href={KemonoGameLink}>
                兽人控游戏库
              </a>
            </div>
            <div className="text-base">kemono.games</div>
          </div>
        </div>
        <div className="text-base font-normal">
          更新最快，收录最全的兽人控游戏索引。
        </div>
      </div>
    </>
  );
};

const KemonoGameIntro = () => {
  return (
    <div
      className="flex-col px-3 py-2"
      onClick={() => window.open(KemonoGameLink)}
    >
      <div className="flex justify-center items-center">
        <KemonoGameIcon size={60} />
        <div className="ml-2">
          <div className="font-bold text-xl leading-6">
            <a onClick={(e) => e.preventDefault()} href={KemonoGameLink}>
              兽人控游戏库
            </a>
          </div>
          <div className="text-base">kemono.games</div>
        </div>
      </div>
      <div className="text-base">
        更新最快，收录最全的兽人控游戏索引。支持模糊检索、标签检索等多种检索方式，支持收藏及评论，并引入了热度系统。网站交互经过精心设计，尽力为用户提供最好的交互体验。
      </div>
    </div>
  );
};

export default KemonoGameIntro;
